INSTRUCTIONS = {
    'citizen_ru': {
        'ru': {
            'text': (
                "📱 Инструкция по активации:\n\n"
                "1. Скачайте официальное приложение оператора\n"
                "2. Нажмите кнопку 'Активировать SIM-карту'\n"
                "3. Введите уникальный код активации\n"
                "4. Авторизуйтесь через Госуслуги\n"
                "5. Подпишите цифровой договор\n"
                "6. Пополните баланс для оплаты абонентской платы\n"
                "7. Зайдите в главный офис оператора и попросите восстановить ваш номер с новым тарифом!\n"
                "❗ ВАЖНО ❗\nДля активации требуется подтвержденный аккаунт на Госуслугах!"
            ),
            "sbermobile": ( "📱 Инструкция по активации:\n\n"
                     "1. При себе иметь паспорт\n"
                     "2.Прийти в отделении сбербанка\n"
                     "3.Выбрать талон сбермобайл, в окне  попросить выдать тариф именно по этому промокоду, чтобы получить тариф со скидкой.\n"
                     "4. Пополнить и активировать на сумму абонентской платы.\n\n"
                     "❗ ВАЖНО ❗ Промокод надо указать в точности как он написан."
            ),
        },
        'uz': {
            'text': (
                "📱 Faollashtirish bo'yicha ko'rsatmalar:\n\n"
                "1. O'zingizning operatoringizning rasmiy ilovasini yuklab oling\n"
                "2. 'SIM-kartani faollashtirish' tugmasini bosing\n"
                "3. Faollashtirish kodi kiriting\n"
                "4. Gosuslugi orqali avtorizatsiya qiling\n"
                "5. Raqamli shartnomani imzolash\n"
                "6. Abonent to‘lovini to‘lash uchun balansingizni to‘ldiring\n"
                "7. Operatorning bosh ofisiga boring va raqamingizni yangi tarif bilan tiklashni so'rang!\n"
                "❗ MUHIM ❗\nFaollashtirish uchun tasdiqlangan Gosuslugi akkaunti talab qilinadi!"
            ),
            "sbermobile": ( "📱 Faollashtirish bo'yicha ko'rsatmalar:\n\n"
                     "1. Pasportingiz bor\n"
                     "2. Sberbank filialiga keling\n"
                     "3. Sbermobayl talonini tanlang, oynada chegirma bilan tarifni olish uchun ushbu promo-kod bo'yicha tarif berishni so'rang.\n"
                     "4. Abonent to'lovi miqdorini to'ldiring va faollashtiring.\n\n"
                     "❗ MUHIM ❗ Promo-kod aynan qanday yozilganligini ko'rsatishi kerak."
            ),
        },
        'tj': {
            'text': (
                "📱 Дастур барои фаъолсозӣ:\n\n"
                "1. Барномаи расмии операторро боргузорӣ кунед\n"
                "2. Кнопкаи 'SIM-картаро фаъолсозӣ' ро пахш кунед\n"
                "3. Рамзи ягонаи фаъолсозиро ворид кунед\n"
                "4. Ба ҳисоби Госуслуг ворид шавед\n"
                "5. Созишномаи рақамиро имзо кунед\n"
                "6. Барои пардохти ҳаққи абонентӣ тавозуни худро пур кунед\n"
                "7. Ба идораи асосии оператор равед ва хоҳиш кунед, ки рақами худро бо тарофаи нав барқарор кунед!\n"
                "❗ МАҲЗ ❗\nБарои фаъолсозӣ ҳисоби тасдиқшуда дар Госуслуг лозим аст!"
            ),
            "sbermobile": ( "📱 Дастур барои фаъолсозӣ:\n\n"
                     "1. Бо худ шиноснома дошта бошед\n"
                     "2. Дар филиали сбербанк биеед\n"
                     "3. Ро интихоб кунед билет сбермобайл, дар равзана хоҳиш кунед, ки тарифро маҳз аз рӯи ин рамзи таблиғотӣ барои гирифтани тариф бо тахфиф пешниҳод кунед.\n"
                     "4. Пур кардан ва фаъол кардан ба маблағи пардохти абонентӣ.\n\n"
                     "❗ МАҲЗ ❗ Рамзи таблиғотӣ бояд дақиқ нишон дода шавад ки он чӣ гуна навишта шудааст."
            ),
        },
    },
    'citizen_foreign': {
        'ru': {
            'sbermobile': (
                "📱 Инструкция для иностранных граждан:\n\n"
                "1. При себе иметь активированный аккаунт на госуслугах и СНИЛС (можно получить в любом ФМС или мои документы)\n"
                "2. Прийти в отделение сбербанка и выбрать талон сбермобайл, в окне попросить выдать тариф именно по этому промокоду для получения тарифа со скидкой\n"
                "3. Сдать биометрию в сбербанке и попросить сотрудников активировать сим карту на госуслугах. \n"
                "4. Пополнить баланс на сумму абонентской платы и можно пользоваться! \n"
                "❗ ВАЖНО ❗\nТребуется аккаунт на Госуслугах и СНИЛС!"
            )
        },
        'uz': {
            'sbermobile': (
                "📱Chet el fuqarolari uchun ko'rsatmalar:\n\n"
                "1. Siz bilan davlat xizmatlari va SNILS-da faollashtirilgan hisob qaydnomangiz bo'lishi kerak (har qanday FMS yoki mening hujjatlarimdan olishingiz mumkin)\n"
                "2. Sberbank filialiga kelib, sbermobile talonini tanlang, oynada chegirma tarifini olish uchun ushbu promo-kod bo'yicha tarif berishni so'rang.\n"
                "3. Sberbankda biometrikadan o'ting va xodimlardan davlat xizmatlarida sim-kartani faollashtirishni so'rang. \n"
                "4. Abonent to'lovi miqdorida balansni to'ldiring va undan foydalanishingiz mumkin! \n"
                "❗ MUHIM ❗ Davlat xizmatlari va SNILS-da hisob talab qilinadi!"
            )
        },
        'tj': {
            'sbermobile': (
                "📱 Дастурамал барои шаҳрвандони хориҷӣ:\n\n"
                "1. Бо худ ҳисоби фаъол дар хадамоти давлатӣ ва SNILS дошта бошед (шумо метавонед ДАР ҲАМА ГУНА FMS е ҳуҷҷатҳои ман гиред)\n"
                "2. Ба филиали сбербанк омада, талони сбермобайлро интихоб кунед, дар тиреза хоҳиш кунед, ки тарифро маҳз аз рӯи ин рамзи таблиғотӣ барои гирифтани тариф бо тахфиф\n диҳад"
                "3. Биометрияро дар сбербанк супоред ва аз кормандон хоҳиш кунед, ки симкортро дар хадамоти давлатӣ фаъол кунанд. \n"
                "4. Бақияро ба маблағи пардохти абонентӣ пур кунед ва шумо метавонед истифода баред! \n"
                "❗ МАҲЗ ❗ ҳисоб дар Хадамоти Давлатӣ ва SNILS талаб карда мешавад!"
            )
        }
    }
}