LOCALES = {
    "ru": {
        "choose_language": "Выберите язык:",
        "welcome": (
            "🤖 Бот - магазин, по продаже уникальных и самых выгодных тарифов в России 🇷🇺\n\n"
            "Подключи выгодный тариф на лучших условиях! 🥰\n"
            "✅ Доступные тарифы со скидкой\n"
            "✅ Простое и быстрое подключение\n"
            "✅ Официальное оформление!\n"
            "✅ Доступно для граждан СНГ!"
        ),
        "choose_citizenship": "Выберите гражданство:",
        "choose_operator": "Выберите оператора:",
        "choose_tariff": "{oper}\nВыберите тариф:",
        "back": "🔙 Назад",
        "payment": "💳 Оплатите тариф:",
        "pay_button": "➡️ Ознакомился",
        "payment_success": (
            "✅ Оплата подтверждена! Код активации:\n\n"
            "Код: <code>{code}</code>\n"
            "Номер: <code>{number}</code>\n\n"
            "📱 Тариф: {tariff_name}\n"
            "💵 Абонентская плата: {tariff_price}₽\n\n"
            "📞 Поддержка: @stan359"
        ),
        "select_tariff": "✅ Выбрать тариф",
        "faq": "❓ Частые вопросы",
        "accept_terms": "✅ 199₽",
        'tariff_disc': (
            "📱 {tariff_name}\n"
            "💵 Абонентская плата: {tariff_price}₽/мес\n"
            "📝 Описание: {tariff_discription}"
        ),
        "restart": "➡️ Купить еще",
        "no_codes_error": "❌ Коды закончились",
        "free": "🤑 Хочу бесплатно", 
        "promo": "Получить промокод",
        'questions': (
            "❓ Часто задаваемые вопросы ❓\n\n"
            "❓Как активировать тариф?\n\n✅Активация происходит самостоятельно, через приложение оператора, вы скачиваете официальное приложение и активируете выданный ботом код активации. Инструкции можно посмотреть после выбора тарифа\n\n"
            "❓Как получить тариф?\n\n✅После активации номера, необходимо пополнить ваш номер на сумму абонентской платы и прийти в ближайший к вам офис с расширенным обслуживанием как указано в инструкции. В офисе запросить восстановление номера и вам выдадут ваш новый выгодный тариф!\n\n"
            "❓Если у меня будут вопросы по тарифу или списаниям куда мне обращаться?\n\n✅Вы можете обращаться в офис оператора или на их горячую линию, а так же в мобильном приложении есть вся необходимая информация.\n\n"
            "❓Можно ли перейти со своим номером?\n\n✅Да, можно, оператор дает такую возможность, в приложении нужно будет выбрать при активации соотвествующий пункт. ( кроме случаев перехода со своим номером на того же оператора)"
        )
    },
    "uz": {
        "choose_language": "Tilni tanlang:",
        "welcome": (
            "🤖 Rossiyada noyob va eng foydali tariflarni sotadigan bot-do'kon\n\n"
            "Eng yaxshi shartlarda foydali tarifni ulang!🥰\n"
            "✅ Arzon chegirmali tariflar!\n"
            "✅ Oddiy, tezkor ulanish!\n"
            "✅ Rasmiy dizayn!\n"
            "✅ MDH fuqarolari uchun mavjud!"
        ),
        "choose_citizenship": "Fuqarolikni tanlang:",
        "choose_operator": "Operatorni tanlang:",
        "choose_tariff": "{oper}\nTarifni tanlang:",
        "back": "🔙 Orqaga",
        "payment": "💳 Tarifni toʻlang:",
        "pay_button": "➡️ Tanishdim",
        "payment_success": (
            "✅ Toʻlov tasdiqlandi! Faollashtirish kodi:\n\n"
            "Kod: <code>{code}</code>\n"
            "Raqam: <code>{number}</code>\n\n"
            "📱 {tariff_name}\n"
            "💵 Abonent to'lovi: {tariff_price}₽\n\n"
            "📞 Qo'llab-quvvatlash: @stan359"
        ),
        "select_tariff": "✅ Tarifni tanlang",
        "faq": "❓ Tez-tez beriladigan savollar",
        "accept_terms": "✅ 199₽",
        'tariff_disc': (
            "📱 {tariff_name}\n"
            "💵 Abonent to'lovi: {tariff_price}₽/oy\n"
            "📝 Tavsif: {tariff_discription}"
        ),
        "restart": "➡️ Ko'proq sotib oling",
        "no_codes_error": "❌ Kodlar tugadi",
        "free": "🤑 Bepul istayman",
        "promo": "✅ Promo-kodni oling",
        'questions': (
            "❓ Tez-tez so'raladigan savollarmi ❓\n\n"
            "❓Tarifni qanday faollashtirish kerak?\n\n✅paketlash mustaqil ravishda, operator ilovasi orqali amalga oshiriladi, siz rasmiy dasturni yuklab olasiz va bot tomonidan berilgan faollashtirish kodini faollashtirasiz. Ko'rsatmalarni tarifini tanlagandan so'ng ko'rish mumkin\n\n"
            "❓Tarifni qanday olish mumkin?\n\n✅Raqamni faollashtirgandan so'ng, siz raqamingizni abonent to'lovi miqdoriga to'ldirishingiz va ko'rsatmalarda ko'rsatilganidek, kengaytirilgan xizmat bilan sizga eng yaqin ofisga kelishingiz kerak. Ofisda raqamni tiklashni so'rang va sizga yangi qulay tarifingiz beriladi!\n\n"
            "❓Agar tarif yoki to'lovlar bo'yicha savollarim bo'lsa, qaerga murojaat qilishim kerak?\n\n✅Siz operatorning ofisiga yoki ularning ishonch telefoniga murojaat qilishingiz mumkin, shuningdek mobil ilovada barcha kerakli ma'lumotlar mavjud.\n\n"
            "❓Raqamingiz bilan borish mumkinmi??\n\n✅Ha, mumkin, operator bunday imkoniyatni beradi, dasturda siz faollashtirilganda tegishli elementni tanlashingiz kerak bo'ladi. (raqamingiz bilan bir xil operatorga o'tish holatlaridan tashqari)"
        )
    },
    "tj": {
        "choose_language": "Забонро интихоб кунед:",
        "welcome":  (
            "🤖 Дӯкони Бот, ки тарифҳои беназир ва фоидаовартаринро дар Русия мефурӯшад\n\n"
            "Нархи арзонро ба шартҳои беҳтарин пайваст кунед!🥰\n"
            "✅ Нархҳои арзон бо тахфиф!\n"
            "✅ Пайвасти осон, зуд!\n"
            "✅ Тарҳрезии расмӣ!\n"
            "✅ Барои шаҳрвандони ИДМ дастрас аст!"
        ),
        "choose_citizenship": "Шаҳрвандиро интихоб кунед:",
        "choose_operator": "Операторро интихоб кунед:",
        "choose_tariff": "{oper}\nТарифро интихоб кунед:",
        "back": "🔙 Бозгашт",
        "payment": "💳 Тарифро пардохт кунед:",
        "pay_button": "➡️ Шинос шуд",
        "payment_success": (
            "✅ Пардохт тасдиқ карда шуд! Рамзи фаъолсозӣ:\n\n"
            "Рамз: <code>{code}</code>\n"
            "Рақам: <code>{number}</code>\n\n"
            "📱 {tariff_name}\n"
            "💵 Пардохти абонентӣ: {tariff_price}₽/мох\n\n"
            "📞 Дастгирӣ: @stan359"
        ),
        "select_tariff": "✅ Тарофаро интихоб кунед",
        "faq": "❓ Саволҳои зуд-зуд додашаванда",
        "accept_terms": "✅ 199₽",
        'tariff_disc': (
            "📱 {tariff_name}\n"
            "💵 Пардохти абонентӣ: {tariff_price}₽/мох\n"
            "📝 Тавсифи: {tariff_discription}"
        ),
        "restart": "➡️ Бештар харед",
        "no_codes_error": "❌ Рамзҳо тамом шуданд",
        "free": "🤑 Мехоҳам барои ройгон",
        "promo": "✅ Рамзи таблиғро гиред",
        'questions': (
            "❓ Саволҳои зуд-зуд додашаванда ❓\n\n"
            "❓Тарифро чӣ гуна бояд фаъол кард?\n\n✅Активизатсия мустақилона тавассути барномаи оператор сурат мегирад, шумо барномаи расмиро зеркашӣ мекунед ва рамзи фаъолсозии ботро фаъол мекунед. Дастурҳоро пас аз интихоби тарофаи дидан мумкин аст\n\n"
            "❓Чӣ тавр ба даст овардани тариф?\n\n✅Пас аз фаъол кардани рақам, шумо бояд рақами худро ба маблағи пардохти абонентӣ пур кунед ва ба идораи наздиктарини худ бо хидмати пешрафта тавре ки дар дастурҳо нишон дода шудааст, биеед. Офис барои барқарор кардани рақам дархост мекунад ва ба шумо нархи нави муфиди шумо дода мешавад!\n\n"
            "❓Агар ман оид ба тарифҳо е пардохтҳо саволҳо дошта бошам, ба куҷо муроҷиат кунам?\n\n✅Шумо метавонед ба идораи оператор е хати доимоамалкунандаи онҳо муроҷиат кунед ва инчунин дар барномаи мобилӣ тамоми маълумоти зарурӣ мавҷуд аст.\n\n"
            "❓Ое шумо метавонед бо рақами худ гузаред?\n\n✅Бале, шумо метавонед, оператор чунин имкониятро медиҳад, дар барнома ҳангоми фаъолсозӣ бояд нуқтаи мувофиқро интихоб кунед. (ба ғайр аз гузаштан аз рақами худ ба ҳамон оператор)"
        )
    }
}